namespace Headstarter.Views;

public partial class NewsPage : ContentPage
{
    public string News1 { get; set; } = @"
Откога си в компанията и защо избра да се присъединиш към нея?

Ема: За Blankfactor разбрах от мой много добър познат, който вече работеше там и продължава да е част от екипа. След като ми разказа за фирмата, реших да кандидатствам и през ноември месец 2023 година станах част от екипа на Blankfactor.

Петър: Вече съм в компанията малко над 3 години. Тук започна кариерата ми като програмист и съм изключително благодарен за възможността. Всички знаем колко трудно е да намериш фирма, която е готова да наеме хора без предишен опит и да инвестира в тяхното развитие – точно това направи компанията за мен.

Димитър: В компанията съм от 9 месеца. За Blankfactor научих от близък колега, с когото сме работили заедно в предишна компания. Той вече беше започнал работа тук и когато го попитах как се чувства в новата си среда, веднага усетих по думите и отношението му, че се чувства ценен, мотивиран и удовлетворен. Това ме убеди, че и аз искам да стана част от тази компания.
";
    public string News2 { get; set; } = @"
Избрах книгата „Към себе си“ на Марк Аврелий, защото…

В непрекъснато променящия се свят на софтуерната индустрия, където единствената константа е промяната, софтуерните специалисти често жонглират с крайни срокове, напрежение и непрестанeн стремеж към иновации. Но какво ще стане, ако ключът към справянето с тази динамика  се крие в книга, написана преди 1800 години от римски император-философ? Изненадващо, но отговорите може да се намерят в книгата „Към себе си“ на Марк Аврелий. 

„Към себе си” не е просто философия. Това е наръчник за всички онези, които ръководят и решават сложни проблеми. В една индустрия, където логиката се сблъсква с несигурността, стоическата мъдрост на Марк Аврелий учи на устойчивост, концентрация и умствена яснота. 

За българските IT специалисти, които търсят нещо повече от технически умения, „Към себе си“ представлява рядък наръчник – пътеводител за усъвършенстване на самия себе си, но и на кода. Това е книга, написана не за читатели или слава, а като личен дневник на човек, който е носил върху плещите си съдбата на най-великата империя на своето време.
";
    public NewsPage()
    {
        InitializeComponent();
        this.BindingContext = this;
    }
}